In [108]:
import pandas as pd
import numpy as np

In [109]:
df = pd.read_csv("income.csv", names=["name","income"], skiprows=1)

In [110]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [111]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [112]:
df['income'].quantile(0.75, interpolation="linear") # Exact POint

7750.0

In [113]:
df['income'].quantile(0.75, interpolation="lower") # Lower bound of a Value

7500

In [114]:
df['income'].quantile(0.75, interpolation="higher") # Upper Bound of a Value

8000

In [115]:
percentile_099 = df.income.quantile(.99) ## Cleaning outliers

In [116]:
df[df.income>percentile_099]

        name    income
6  Elon Musk  10000000

In [117]:
cleaned_df = df[df.income<=percentile_099]

In [136]:
cleaned_df

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [137]:
df['income'][df.name=="Sofia"] = np.NaN

In [139]:
df.fillna(df.income.median())

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0